documents/sponsor/state-sponsor.mmd
---
title: Sponsor - State Diagram
---
stateDiagram-v2
    [*] --> PENDING : Create Sponsorship
    PENDING --> PAID : Payment Success (Webhook)
    PAID --> [*]
